# Housing Market

#  # Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

# Step 1. Import the necessary libraries

In [1]:
import numpy as np
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

# Step 2. Create 3 differents Series, each of length 100, as follows:

The first a random number from 1 to 4



The second a random number from 1 to 3




The third a random number from 10,000 to 30,00

In [2]:
s1 = pd.Series(np.random.randint(1, high=5, size=100, dtype='l'))
s2 = pd.Series(np.random.randint(1, high=4, size=100, dtype='l'))
s3 = pd.Series(np.random.randint(10000, high=30001, size=100, dtype='l'))

print(s1, s2, s3)

0     1
1     2
2     2
3     2
4     2
     ..
95    3
96    3
97    2
98    1
99    2
Length: 100, dtype: int32 0     2
1     1
2     2
3     2
4     1
     ..
95    1
96    1
97    2
98    2
99    1
Length: 100, dtype: int32 0     19199
1     29022
2     26557
3     13955
4     11562
      ...
95    20908
96    29967
97    11178
98    19024
99    25851
Length: 100, dtype: int32

# Step 3. Let's create a DataFrame by joinning the Series by column

In [3]:
housemkt=pd.concat([s1,s2,s3],axis=1)

In [4]:
housemkt.head()

   0  1      2
0  1  2  19199
1  2  1  29022
2  2  2  26557
3  2  2  13955
4  2  1  11562

# Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [9]:
housemkt.rename(columns={0:'bedrs',1:'bathrs',2:'price_sqr_meter'})

    bedrs  bathrs  price_sqr_meter
0       1       2            19199
1       2       1            29022
2       2       2            26557
3       2       2            13955
4       2       1            11562
..    ...     ...              ...
95      3       1            20908
96      3       1            29967
97      2       2            11178
98      1       2            19024
99      2       1            25851

[100 rows x 3 columns]

# Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [10]:
bigcolumn=pd.concat([s1+s2+s3],axis=0)

In [16]:
type(bigcolumn)

pandas.core.series.Series

In [17]:
bigcolumn=bigcolumn.to_frame()

In [18]:
type(bigcolumn)

pandas.core.frame.DataFrame

In [19]:
bigcolumn.head()

       0
0  19202
1  29025
2  26561
3  13959
4  11565

# Step 6. Oops, it seems it is going only until index 99. Is it true?

In [20]:
len(bigcolumn)

100

# Step 7. Reindex the DataFrame so it goes from 0 to 100

In [22]:
bigcolumn.reset_index(drop=True,inplace=True)

In [24]:
len(bigcolumn)

100

In [ ]:
#Student of DataScience
#Student of DataTrained-Saurav
#Date-01-08-2022
#Time-15:30